<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [Klog-users] New version of KLog released 0.4.12/ Liberada una nueva versi&#243;n de KLog - 0.4.2
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/klog-users/2007-September/index.html" >
   <LINK REL="made" HREF="mailto:klog-users%40lists.berlios.de?Subject=Re%3A%20%5BKlog-users%5D%20%3D%3Fiso-8859-15%3Fq%3FNew_version_of_KLog_released_0%3D2E4%3F%3D%0A%09%3D%3Fiso-8859-15%3Fq%3F%3D2E12/_Liberada_una_nueva_versi%3DF3n_de_KLog_-_0%3D2E%3F%3D%0A%09%3D%3Fiso-8859-15%3Fq%3F4%3D2E2%3F%3D&In-Reply-To=%3C200709132218.02025.jaime%40robles.nu%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000017.html">
   
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[Klog-users] New version of KLog released 0.4.12/ Liberada una nueva versi&#243;n de KLog - 0.4.2</H1>
    <B>Jaime Robles</B> 
    <A HREF="mailto:klog-users%40lists.berlios.de?Subject=Re%3A%20%5BKlog-users%5D%20%3D%3Fiso-8859-15%3Fq%3FNew_version_of_KLog_released_0%3D2E4%3F%3D%0A%09%3D%3Fiso-8859-15%3Fq%3F%3D2E12/_Liberada_una_nueva_versi%3DF3n_de_KLog_-_0%3D2E%3F%3D%0A%09%3D%3Fiso-8859-15%3Fq%3F4%3D2E2%3F%3D&In-Reply-To=%3C200709132218.02025.jaime%40robles.nu%3E"
       TITLE="[Klog-users] New version of KLog released 0.4.12/ Liberada una nueva versi&#243;n de KLog - 0.4.2">jaime at robles.nu
       </A><BR>
    <I>Thu Sep 13 22:18:00 CEST 2007</I>
    <P><UL>
        <LI>Previous message: <A HREF="000017.html">[Klog-users] Hamlib does not work
</A></li>
        
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#18">[ date ]</a>
              <a href="thread.html#18">[ thread ]</a>
              <a href="subject.html#18">[ subject ]</a>
              <a href="author.html#18">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE> (Versi&#243;n en espa&#241;ol al final)

 I am &#160;happy to announce that the release of 0.4.2 version of KLog is
 available.

The mailing list of KLog is in <A HREF="https://lists.berlios.de/mailman/listinfo/klog-users">Klog-users at lists.berlios.de</A> for 
discussion about KLog, wishlist, bug report, ideas, suggestions tips on 
using,
 ...

 The main language of the list if English.

 Subscribe at:

 &#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;<A HREF="https://lists.berlios.de/mailman/listinfo/klog-users">https://lists.berlios.de/mailman/listinfo/klog-users</A>

 From the Changelog:

12-Sep-2007 - 0.4.2

- New feature: The user can now configure to require or not the 
mandatory data for each QSO (QRZ, date, time, band, mode, RST tx &amp; RST 
rx. (if not all the mandatory fields are entered, KLog's behaviour may 
be unexpected but it allows to import logs from other software that 
does not add all the data).
- New feature: Klog creates a temp file (~.klog/tempklog.adi) where it 
saves automatically all the QSOs entered until the log is manually 
saved. It prevents the log to be lost in case of unprevented 
KLog/computer failure. (TNX SM5OUU)
- BUG fixed: If the field (maybe any other field too) COMMENT is more 
than one line long, the log is broken and cannot be read. (TNX SM5OUU)
- BUG fixed: KLog does not ask for the file name if you have previously 
opened one file and the name has not changed.
- BUG fixed: In the GUI, the &quot;Preferences&quot; is correctly shown and not 
as &quot;&amp;Preferences&quot;.
- BUG fixed: When modifying a QSO, the number of QSOs was incremented 
when the user click over OK.
- BUG fixed: If a QSO was deleted the awards/number of QSO where not 
decresed.
- GUI improved: Deleted the WAE box (the WAE calculations was not 
implemented).
- New translation: KLog is now also in Swedish. (TNX SM4BE)
- New translation: KLog is now also in Galician. (TNX Fuco Mera)
- Updated German translation. (TNX DL5PD)
- Updated Spanish translation.  (EA4TV).

This release of KLog isin English, Spanish, Portuguese, Brazilian 
portuguese, German, Serbian, Galizian and Swedish.

 KLog can still have many bugs and other not yet implemented features.
 You can download KLog from:

 <A HREF="http://jaime.robles.nu/klog">http://jaime.robles.nu/klog</A>

 You will find the tar.gz sources and the debian package (debian
 package only in my homepage)
 You can see some screenshots in the web.

 The KLog's new-releases email list is created using the addresses of
 people I have previously received emails from about KLog. Feel free
 to ask me to remove your address if you don't want to be alerted of
 new KLog releases.

 Thanks for your help and I hope you find KLog useful.
 73
 =========================================================
 (Spanish version)

 Me alegro de anunciaros que ya est&#225; disponible la versi&#243;n 0.4.1 de
 &#160;KLog.

La lista de KLog es (<A HREF="https://lists.berlios.de/mailman/listinfo/klog-users">Klog-users at lists.berlios.de</A>) para charlar sobre 
KLog, pedir  funcionalidades, avisar de errores, ideas, sugerencias, 
trucos sobre  c&#243;mo usarlo, ...

 El lenguaje principal de la lista es el ingl&#233;s.

 Subscribete en:

 &#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;<A HREF="https://lists.berlios.de/mailman/listinfo/klog-users">https://lists.berlios.de/mailman/listinfo/klog-users</A>


 Del fichero Changelog vemos los cambios:

- Nueva funcionalidad: El usuario puede configurar el requerir o no los 
campos obligatorios para cada QSO (QRZ, fecha, hora, banda, modo, RST 
(rx y tx). (Si no se introducen todos los campos obligatorios, KLog 
puede tener un comportamiento inesperado, pero permite importar datos 
de programas que no incluyen todos estos campos).
- Nueva funcionalidad: Klog crea un fichero temporal que se guarda 
autom&#225;ticamente guardando todos los QSO hasta que el log se guarda de 
forma manual. Previene de p&#233;rdida de datos en caso de fallo de KLog o 
el ordenador. (TNX SM5OUU)
- Error corregido: En el campo (puede que en otros tambien) COMENTARIO, 
si hab&#237;a m&#225;s de una l&#237;nea, el log se corromp&#237;a y no pod&#237;a leerse. (TNX 
SM5OUU)
- Error corregido: KLog volv&#237;a a preguntar el nombre del fichero en el 
que guardar el log aunque no fuera nuevo y lo hubieramos abierto 
previamente
- Error corregido: En la interfaz gr&#225;fica, las &quot;Preferencias&quot; se 
muestran ahora correctamente y no como &quot;&amp;Preferencias&quot;.
- Error corregido: Cuando se modificaba un QSO, se incrementaba el 
n&#250;mero de QSO.
- Error corregido: Si se borraba un QSO, no se decrementaba el n&#250;mero de 
QSO y diplomas.
- Interfaz gr&#225;fica mejorada: Se ha eliminado el campo WAE (porque no 
estaban implementada la gesti&#243;n de dicho diploma).
- Nueva traducci&#243;n: KLog est&#225; ahora tambi&#233;n en sueco. (TNX SM4BE)
- Nueva traducci&#243;n: KLog est&#225; ahora tambi&#233;n en galllego. (TNX Fuco Mera)
- Actualizada la versi&#243;n en alem&#225;n. (TNX DL5PD)
- Actualizada la versi&#243;n en espa&#241;ol. (EA4TV).


Klog est&#225; disponible en ingl&#233;s, espa&#241;ol, portugu&#233;s, portugu&#233;s brasile&#241;o, 
alem&#225;n, serbio, gallego y sueco.

 KLog puede tener a&#250;n muchos errores y otras funciones por
 implementar. Puedes descargar KLog de:
 <A HREF="http://jaime.robles.nu/klog">http://jaime.robles.nu/klog</A>

 Encontrar&#225;s las fuentes en tar.gz o el paquete de Debian (el paquete
 de Debian s&#243;lo en mi p&#225;gina)

 Puedes ver capturas de pantalla en la web.


 La lista de aviso de nuevas versiones de KLog la he ido creando con
 las direcciones de las personas que previamente me han enviado algo
 sobre KLog. Si prefieres que no te envie estos mensajes, avisame y
 quitar&#233; tu direcci&#243;n de la lista.

 Gracias por tu ayuda y espero que KLog te resulte &#250;til.
 73

-- 
Un saludo,
	Jaime Robles, EA4TV
	<A HREF="https://lists.berlios.de/mailman/listinfo/klog-users">jaime at robles.nu</A>

Visita:
   <A HREF="http://jaime.robles.nu">http://jaime.robles.nu</A>
   <A HREF="http://www.redlibre.net">http://www.redlibre.net</A> - La Red Libre de todos!		

</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000017.html">[Klog-users] Hamlib does not work
</A></li>
	
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#18">[ date ]</a>
              <a href="thread.html#18">[ thread ]</a>
              <a href="subject.html#18">[ subject ]</a>
              <a href="author.html#18">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/klog-users">More information about the Klog-users
mailing list</a><br>
</body></html>
